In [1]:
import pandas as pd

# BookCrossing dataset

In [10]:
data_path = "data/bookcrossing/"
ratings = pd.read_csv(f"{data_path}ratings.csv")
items = pd.read_csv(f"{data_path}items.csv")
users = pd.read_csv(f"{data_path}users.csv")

In [11]:
ratings.head()

   user_id     item_id  rating
0   276725  034545104X       0
1   276726  0155061224       5
2   276727  0446520802       0
3   276729  052165615X       3
4   276729  0521795028       6

In [12]:
items.head()

,item_id,title,author,year,publisher,img_s,img_m,img_l
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [13]:
users.head()

   user_id                            location   age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [3]:
print(
    f"""
Users.shape : {users.shape},
Items.shape : {items.shape},
Ratings.shape : {ratings.shape},

Users.columns : {users.columns.tolist()},
Items.columns : {items.columns.tolist()},
Ratings.columns : {ratings.columns.tolist()},
"""
)

Users.shape : (278858, 3),
Items.shape : (271379, 8),
Ratings.shape : (1149780, 3),

Users.columns : ['user_id', 'location', 'age'],
Items.columns : ['item_id', 'title', 'author', 'year', 'publisher', 'img_s', 'img_m', 'img_l'],
Ratings.columns : ['user_id', 'item_id', 'rating'],

In [4]:
print(
    f"""
Users nan :\n{users.isna().sum()},\n
Items nan :\n{items.isna().sum()},\n
Ratings nan :\n{ratings.isna().sum()},
"""
)

Users nan :
user_id          0
location         0
age         110762
dtype: int64,

Items nan :
item_id      0
title        0
author       1
year         0
publisher    2
img_s        0
img_m        0
img_l        0
dtype: int64,

Ratings nan :
user_id    0
item_id    0
rating     0
dtype: int64,

In [5]:
del ratings, users, items

# Anime dataset

[Kaggle data link](https://www.kaggle.com/datasets/CooperUnion/anime-recommendations-database)

In [15]:
data_path = "data/anime/"

items = pd.read_csv(f"{data_path}items.csv")
ratings = pd.read_csv(f"{data_path}rating.csv")
items.head()

,anime_id,name,genre,type,episodes,rating,members
0,32281,Kimi no Na wa.,"Drama, Romance, School, Supernatural",Movie,1,9.37,200630
1,5114,Fullmetal Alchemist: Brotherhood,"Action, Adventure, Drama, Fantasy, Magic, Mili...",TV,64,9.26,793665
2,28977,Gintama°,"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.25,114262
3,9253,Steins;Gate,"Sci-Fi, Thriller",TV,24,9.17,673572
4,9969,Gintama&#039;,"Action, Comedy, Historical, Parody, Samurai, S...",TV,51,9.16,151266

In [16]:
ratings.head()

   user_id  anime_id  rating
0        1        20      -1
1        1        24      -1
2        1        79      -1
3        1       226      -1
4        1       241      -1

In [17]:
print(
    f"""
Items.shape : {items.shape},
Ratings.shape : {ratings.shape},

Items.columns : {items.columns.tolist()},
Ratings.columns : {ratings.columns.tolist()},
"""
)

Items.shape : (12294, 7),
Ratings.shape : (7813737, 3),

Items.columns : ['anime_id', 'name', 'genre', 'type', 'episodes', 'rating', 'members'],
Ratings.columns : ['user_id', 'anime_id', 'rating'],

In [18]:
print(
    f"""
Items nan : {items.isna().sum()},
Ratings nan : {ratings.isna().sum()},
"""
)

Items nan : anime_id      0
name          0
genre        62
type         25
episodes      0
rating      230
members       0
dtype: int64,
Ratings nan : user_id     0
anime_id    0
rating      0
dtype: int64,

In [19]:
del items, ratings

# LastFM dataset

In [21]:
data_path = "data/lastfm/"

In [ ]:
# для 1-ого раза
ratings = pd.read_table(f"{data_path}usersha1-artmbid-artname-plays.tsv")
ratings.columns = ["user_id", "artist_id", "artist", "plays"]

users = pd.read_table(f"{data_path}usersha1-profile.tsv")
users.columns = [
    "user_id",
    "gender",
    "age",
    "country",
    "signup_date",
]

ratings.head()

In [23]:
# для n-ого(n>1) раза
ratings = pd.read_csv(f"{data_path}ratings.csv")
users = pd.read_csv(f"{data_path}users.csv")

ratings.head()

,user_id,artist_id,artist,plays
0,00000c289a1829a808ac09c00daf10bc3c4e223b,f2fb0ff0-5679-42ec-a55c-15109ce6e320,die Ärzte,1099
1,00000c289a1829a808ac09c00daf10bc3c4e223b,b3ae82c2-e60b-4551-a76d-6620f1b456aa,melissa etheridge,897
2,00000c289a1829a808ac09c00daf10bc3c4e223b,3d6bbeb7-f90e-4d10-b440-e153c0d10b53,elvenking,717
3,00000c289a1829a808ac09c00daf10bc3c4e223b,bbd2ffd7-17f4-4506-8572-c1ea58c3f9a8,juliette & the licks,706
4,00000c289a1829a808ac09c00daf10bc3c4e223b,8bfac288-ccc5-448d-9573-c33ea2aa5c30,red hot chili peppers,691

In [24]:
users.head()

,user_id,gender,age,country,signup_date
0,00001411dc427966b17297bf4d69e7e193135d89,f,NaN,Canada,"Dec 4, 2007"
1,00004d2ac9316e22dc007ab2243d6fcb239e707d,NaN,NaN,Germany,"Sep 1, 2006"
2,000063d3fe1cf2ba248b9e3c3f0334845a27a6bf,m,19.0,Mexico,"Apr 28, 2008"
3,00007a47085b9aab8af55f52ec8846ac479ac4fe,m,28.0,United States,"Jan 27, 2006"
4,0000c176103e538d5c9828e695fed4f7ae42dd01,m,20.0,United Kingdom,"Jan 14, 2006"

In [25]:
print(
    f"""
Users.shape : {users.shape},
Ratings.shape : {ratings.shape},

Users.columns : {users.columns.tolist()},
Ratings.columns : {ratings.columns.tolist()},
"""
)

Users.shape : (359346, 5),
Ratings.shape : (17535654, 4),

Users.columns : ['user_id', 'gender', 'age', 'country', 'signup_date'],
Ratings.columns : ['user_id', 'artist_id', 'artist', 'plays'],

In [26]:
print(
    f"""
Users nan :\n{users.isna().sum()}\n\n{users.isna().sum() / users.shape[0]},\n
Ratings nan :\n{ratings.isna().sum()}\n\n{ratings.isna().sum() / ratings.shape[0]},
"""
)

Users nan :
user_id            0
gender         32775
age            74900
country            0
signup_date        0
dtype: int64

user_id        0.000000
gender         0.091207
age            0.208434
country        0.000000
signup_date    0.000000
dtype: float64,

Ratings nan :
user_id           0
artist_id    226137
artist          204
plays             0
dtype: int64

user_id      0.000000
artist_id    0.012896
artist       0.000012
plays        0.000000
dtype: float64,

In [27]:
# кол-во бракованных юзеров в матрице взаимодействий
ratings["user_id"].apply(
    lambda x: len(x) != len("00000c289a1829a808ac09c00daf10bc3c4e223b")
).sum()

86

сохраняю в файлы с нормальным названием

In [17]:
ratings.to_csv(f"{data_path}ratings.csv", index=False)
users.to_csv(f"{data_path}users.csv", index=False)

In [18]:
!rm data/lastfm/*.tsv